openshwprojects/OpenBK7231T_App/platforms/W800/override/sdk/OpenW800/include/wm_regs.h
#define DMA_MODE_SEL_MASK										(0xF<<2)
#define DMA_MODE_SEL_UART_RX               (0<<2)
#define DMA_MODE_SEL_UART_TX               (1<<2)
#define DMA_MODE_SEL_PWM0				(2<<2)
#define DMA_DODE_SEL_PWM1				(3<<2)
#define DMA_MODE_SEL_LSSPI_RX                 (4<<2)
#define DMA_MODE_SEL_LSSPI_TX                 (5<<2)
#define DMA_MODE_SEL_SDADC_CH0             (6<<2)
#define DMA_MODE_SEL_SDADC_CH1             (7<<2)
#define DMA_MODE_SEL_SDADC_CH2            (8<<2)
#define DMA_MODE_SEL_SDADC_CH3            (9<<2)
#define DMA_MODE_SEL_I2S_RX								(10<<2)
#define DMA_MODE_SEL_I2S_TX								(11<<2)
#define DMA_MODE_SEL_SDIOHOST							(12<<2)

#define DMA_MODE_CHAIN_LINK_EN             (1<<6)

#define DMA_CTRL_AUTO_RELOAD                 (1<<0)
#define DMA_CTRL_SRC_ADDR_INC                (1<<1)
#define DMA_CTRL_SRC_ADDR_CIR								 (3<<1)
#define DMA_CTRL_DEST_ADDR_INC              (1<<3)
#define DMA_CTRL_DEST_ADDR_CIR							(3<<3)
#define DMA_CTRL_DATA_SIZE_BYTE            (0<<5)
#define DMA_CTRL_DATA_SIZE_SHORT          (1<<5)
#define DMA_CTRL_DATA_SIZE_WORD           (2<<5)
#define DMA_CTRL_BURST_SIZE1                   (0<<7)
#define DMA_CTRL_BURST_SIZE4                   (1<<7)

#define DMA_CTRL_TOTAL_MASK									 (0xFFF<<8)
#define DMA_CTRL_TOTAL_SIZE(n)               (n<<8)

/***************************************************************
 * PMU Reg
 ***************************************************************/
#define HR_PMU_BASE_ADDR                (DEVICE_BASE_ADDR + 0xD00)
#define HR_PMU_PS_CR                    (HR_PMU_BASE_ADDR + 0x00)
#define HR_PMU_TIMER0                   (HR_PMU_BASE_ADDR + 0x04)
#define HR_PMU_TIMER1                   (HR_PMU_BASE_ADDR + 0x08)
#define HR_PMU_RTC_CTRL1               	(HR_PMU_BASE_ADDR + 0x0C)
#define HR_PMU_RTC_CTRL2                (HR_PMU_BASE_ADDR + 0x10)
#define HR_PMU_INTERRUPT_SRC            (HR_PMU_BASE_ADDR + 0x14)
#define HR_PMU_INTERRUPT_MASK          	(HR_PMU_BASE_ADDR + 0x18)
#define HR_PMU_WLAN_STTS                (HR_PMU_BASE_ADDR + 0x1C)
#define HR_PMU_BK_REG                   (HR_PMU_BASE_ADDR + 0x20)

#define PMU_TIMER0_NTERRUPT_SRC         (1UL << 0)
#define PMU_TIMER1_NTERRUPT_SRC         (1UL << 1)
#define PMU_GPIO_NTERRUPT_SRC           (1UL << 2)


/***************************************************************
 * system clock and bus clock Reg
 ***************************************************************/
#define HR_CLK_BASE_ADDR        (DEVICE_BASE_ADDR + 0xE00)
#define HR_CLK_GATE_EN           HR_CLK_BASE_ADDR
#define HR_CLK_SOFT_CLK_MASK    (HR_CLK_BASE_ADDR + 0x04) 
#define HR_CLK_BBP_CLT_CTRL     (HR_CLK_BASE_ADDR + 0x08)
#define HR_CLK_RST_CTL         	(HR_CLK_BASE_ADDR + 0x0c)
#define HR_CLK_DIV_CTL			(HR_CLK_BASE_ADDR + 0x10)
#define HR_CLK_SEL_CTL			(HR_CLK_BASE_ADDR + 0x14)
#define HR_OSC_32K_REG			(HR_CLK_BASE_ADDR + 0x14)
#define HR_CLK_I2S_CTL			(HR_CLK_BASE_ADDR + 0x18)
#define HR_CLK_RST_STA			(HR_CLK_BASE_ADDR + 0x1C)

/***************************************************************
 * 内存模块寄存器定义
 ***************************************************************/
#define HR_MEM_BASE_ADDR        	(DEVICE_BASE_ADDR + 0xF00)
#define HR_MEM_TXBUF_BASE_ADDR      (HR_MEM_BASE_ADDR + 0x00)
#define HR_MEM_RXBUF_BASE_ADDR      (HR_MEM_BASE_ADDR + 0x04)
#define HR_MEM_BUF_NUM_CFG          (HR_MEM_BASE_ADDR + 0x08)
#define HR_MEM_BUF_SIZE_CFG         (HR_MEM_BASE_ADDR + 0x0C)
#define HR_MEM_AGGR_CFG             (HR_MEM_BASE_ADDR + 0x10)
#define HR_MEM_BUF_EN               (HR_MEM_BASE_ADDR + 0x14)

/***************************************************************
* PSRAM CTRL Register
****************************************************************/
#define HR_PSRRAM_BASE_ADDR      (DEVICE_BASE_ADDR + 0x2200)
#define HR_PSRAM_CTRL_ADDR       (HR_PSRRAM_BASE_ADDR+ 0x00)
#define HR_PSRAM_OVERTIMER_ADDR  (HR_PSRRAM_BASE_ADDR+ 0x04)

/* APB BaseAddr*/
#define HR_APB_BASE_ADDR 0x40010000

/***************************************************************
 * I2C Reg
 ***************************************************************/
#define HR_I2C_BASE_ADDR    (HR_APB_BASE_ADDR)
#define HR_I2C_PRER_LO              (HR_I2C_BASE_ADDR + 0x0)
#define HR_I2C_PRER_HI              (HR_I2C_BASE_ADDR + 0x04)
#define HR_I2C_CTRL                 (HR_I2C_BASE_ADDR + 0x08)
#define HR_I2C_TX_RX                   (HR_I2C_BASE_ADDR + 0x0C)
#define HR_I2C_CR_SR                   (HR_I2C_BASE_ADDR + 0x10)
#define HR_I2C_TXR               (HR_I2C_BASE_ADDR + 0x14)
#define HR_I2C_CR               (HR_I2C_BASE_ADDR + 0x18)


#define I2C_CTRL_INT_DISABLE	(0x1UL<<6)
#define I2C_CTRL_ENABLE			(0x1UL<<7)

#define I2C_CR_STA				(0x1UL<<7)
#define I2C_CR_STO				(0x1UL<<6)
#define I2C_CR_RD				(0x1UL<<5)
#define I2C_CR_WR				(0x1UL<<4)
#define I2C_CR_NAK				(0x1UL<<3)
#define I2C_CR_IACK				(0x1UL)

#define I2C_SR_NAK				(0x1UL<<7)
#define I2C_SR_BUSY					(0x1UL<<6)
#define I2C_SR_TIP				(0x1UL<<1)
#define I2C_SR_IF				(0x1UL)


/***************************************************************
 * SD ADC Reg
 ***************************************************************/
#define HR_SD_ADC_BASE_ADDR         (HR_APB_BASE_ADDR + 0x200)
#define HR_SD_ADC_RESULT_REG     	((HR_SD_ADC_BASE_ADDR+0x000))
#define HR_SD_ADC_ANA_CTRL        	((HR_SD_ADC_BASE_ADDR+0x004))
#define HR_SD_ADC_PGA_CTRL	       ((HR_SD_ADC_BASE_ADDR+0x008))
#define HR_SD_ADC_TEMP_CTRL	       ((HR_SD_ADC_BASE_ADDR+0x00C))
#define HR_SD_ADC_CTRL        	   ((HR_SD_ADC_BASE_ADDR+0x010))
#define HR_SD_ADC_INT_STATUS   	   ((HR_SD_ADC_BASE_ADDR+0x014))
#define HR_SD_ADC_CMP_VALUE    	   ((HR_SD_ADC_BASE_ADDR+0x018))


/***************************************************************
 *Low Speed SPI Reg
 ***************************************************************/
#define HR_SPI_BASE_ADDR            (HR_APB_BASE_ADDR + 0x400)
#define HR_SPI_CHCFG_REG		   		(HR_SPI_BASE_ADDR + 0x000)
#define HR_SPI_SPICFG_REG		   		(HR_SPI_BASE_ADDR + 0x004)
#define HR_SPI_CLKCFG_REG		   		(HR_SPI_BASE_ADDR + 0x008)
#define HR_SPI_MODECFG_REG		   	(HR_SPI_BASE_ADDR + 0x00C)
#define HR_SPI_INT_MASK_REG		   		(HR_SPI_BASE_ADDR + 0x010)
#define HR_SPI_INT_STATUS_REG		   		(HR_SPI_BASE_ADDR + 0x014)
#define HR_SPI_STATUS_REG		   	(HR_SPI_BASE_ADDR + 0x018)
#define HR_SPI_TIMEOUT_REG		   	(HR_SPI_BASE_ADDR + 0x01C)
#define HR_SPI_TXDATA_REG		   		(HR_SPI_BASE_ADDR + 0x020)
#define HR_SPI_TRANSLEN_REG		   	(HR_SPI_BASE_ADDR + 0x024)
#define HR_SPI_SLV_XMIT_LEN_REG		   	(HR_SPI_BASE_ADDR + 0x028)
#define HR_SPI_RXDATA_REG		   		(HR_SPI_BASE_ADDR + 0x030)


